{
  "backend/main.mo": "Motoko backend defining authorization, data types, and map‑based storage for businesses, profiles, services, clients, availability, and appointments, including profile query and save functions.",
  "feature_evidence.json": "Feature evidence report mapping product features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based light/dark theme tokens and base styles.",
  "frontend/index.html": "HTML entry point loading the root React application via main.tsx.",
  "frontend/src/App.tsx": "Top‑level React router configuration handling authentication, onboarding, dashboard routes, and public booking pages.",
  "frontend/src/components/AppHeader.tsx": "Header component showing branding, user info, and logout logic with special handling for public booking pages.",
  "frontend/src/hooks/queries/useAppointments.ts": "React Query hooks for fetching appointments and creating public bookings with automatic cache invalidation.",
  "frontend/src/hooks/queries/useAvailability.ts": "React Query hooks for retrieving and updating staff availability per business.",
  "frontend/src/hooks/queries/useBusinessProfile.ts": "React Query hooks for fetching business profiles and creating new business records.",
  "frontend/src/hooks/queries/useClients.ts": "Provides React Query hooks to fetch all clients and add a client, invalidating cache on updates.",
  "frontend/src/hooks/queries/useServices.ts": "Implements hooks to load all services and add a service using the actor, with query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useBusinessId.ts": "Derives a stable business ID from the current user's principal.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Defines hooks to fetch and update the caller's user profile via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context with login, logout, and AuthClient initialization logic.",
  "frontend/src/index.css": "Sets global Tailwind layers and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/dashboard/AppointmentsPage.tsx": "Displays all appointments, resolves service and client names, highlights upcoming ones, and shows loading and empty states.",
  "frontend/src/pages/dashboard/AvailabilityPage.tsx": "Lets staff configure weekly availability, loading existing settings and saving updates via mutations.",
  "frontend/src/pages/dashboard/ClientsPage.tsx": "Shows a client list and provides a dialog to add new clients with basic validation.",
  "frontend/src/pages/dashboard/DashboardLayout.tsx": "Provides dashboard navigation and renders the selected section using an Outlet.",
  "frontend/src/pages/dashboard/ServicesPage.tsx": "Lists services and includes a dialog for adding new services with duration input.",
  "frontend/src/pages/LandingSignInPage.tsx": "Landing page UI that promotes features and triggers Internet Identity login.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles initial user onboarding by saving profile data and creating a business.",
  "frontend/src/pages/PublicBookingPage.tsx": "Public-facing booking flow that loads business data, shows services, and submits appointment requests.",
  "frontend/src/utils/dateTime.ts": "Formats appointment timestamps and converts between dates and bigint timestamps.",
  "frontend/src/utils/errorMessages.ts": "Maps common error message patterns to user-friendly strings.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and cleanup for routing contexts.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, metadata, required images, and a list of implemented features for an appointment scheduling app."
}